In [28]:
import pandas as pd
import sqlalchemy as sql
import pyodbc as pyo
import numpy as np

In [29]:
server = 'CALUMO-949324'
driver = 'SQL+Server'
db = 'name'
engine = sql.create_engine('mssql+pyodbc://{}/{}?driver={}'.format(server, db, driver))

In [30]:
import zipfile

In [31]:
zipfile.ZipFile('names.zip').extractall('.')

In [ ]:
import os
os.listdir('names')

In [ ]:
open('names/yob2011.txt','r').readlines()[:10]

In [34]:
names2011 = pd.read_csv('names/yob2011.txt')

In [35]:
names2011.head()

     Sophia  F  21816
0  Isabella  F  19870
1      Emma  F  18777
2    Olivia  F  17294
3       Ava  F  15480
4     Emily  F  14236

In [36]:
names2011 = pd.read_csv('names/yob2011.txt', names = ['name','sex','number'])

In [ ]:
names2011.head()

In [ ]:
names_all = []
for year in range (1880,2014+1):
    names_all.append(pd.read_csv('names/yob{}.txt'.format(year),names=['name','sex','number']))
    names_all[-1]['year'] = year

In [40]:
allyears = pd.concat(names_all)

In [41]:
allyears.head()

        name sex  number  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [42]:
allyears.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1825433 entries, 0 to 33043
Data columns (total 4 columns):
name      object
sex       object
number    int64
year      int64
dtypes: int64(2), object(2)
memory usage: 69.6+ MB

#send from PANDAS pd to SQL

In [43]:
allyears.to_sql('dbo.AllYears', con = engine, if_exists = 'append', chunksize = 1000)